app/views/searches/show.html.erb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%Post%')
SELECT  1 AS one FROM "posts" WHERE (title LIKE '%Hola%') AND (description LIKE '%Hola%') AND (body LIKE '%Hola%') LIMIT ?  [["LIMIT", 1]]
---

<% if @search.search_posts.empty? %>

SELECT "posts".* FROM "posts" WHERE (title LIKE '%Post%')
---
<% else %>
	<% @search.search_posts.each do |p| %>