app/controllers/comments_controller.rb

  def create
    @post =Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)
    @comment.user =current_user
    @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Buena locooo\r\n"], ["post_id", 1], ["user_id", 1], ["created_at", "2019-06-11 18:14:31.726172"], ["updated_at", "2019-06-11 18:14:31.726172"]]