app/controllers/dumpsters_controller.rb

SELECT "dumpsters".* FROM "dumpsters"
---
  def index
    @dumpsters = Dumpster.all