app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
    @places = Place.all

INSERT INTO "places" ("name", "address", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save

UPDATE "places" SET "address" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["address", "Santiago, Chile"], ["updated_at", "2019-06-14 00:19:19.295708"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @place.update(place_params)

DELETE FROM "places" WHERE "places"."id" = ?  [["id", 4]]
---
  def destroy
    @place.destroy

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_place
      @place = Place.find(params[:id])