app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "author", "creation_date", "location", "topic", "body", "attachments", "post_type", "innapropriate_status", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user =current_user
    @post = @user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "Probando FInal champions"], ["updated_at", "2019-06-14 02:41:59.692298"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def destroy
    @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])