app/controllers/searches_controller.rb

	def create
		@search = Search.create(search_params)
---
INSERT INTO "searches" ("keywords", "created_at", "updated_at") VALUES (?, ?, ?)  [["keywords", "Hola"], ["created_at", "2019-07-03 23:37:23.586819"], ["updated_at", "2019-07-03 23:37:23.586819"]]

	def show
		@search = Search.find(params[:id])
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]